"""
Home Work 4

1. Пользователь вводит с клавиатуры числа, до тех пор, пока не введет число 0. На основе введенных данных нужно сформировать список, состоящий из квадратов введенных чисел.

2. Написать программу удаления из списка

['+7912123456', '+7915213456', '+6915213456', '+4915213456', '+7915213456']

всех номеров с кодом «+7».

3. Написать программу циклического сдвига элементов списка влево. Например, дан список:

[1,2,3,4,5,6]

после сдвига на один элемент влево, должны получить:

[2,3,4,5,6,1]

Реализовать через цикл, перебирая все элементы.

4. Написать аналогичную программу циклического сдвига, но теперь вправо.
"""